In [1]:
import pandas as pd

In [2]:
purchases = pd.read_csv("data/purchases.txt")
purchases = purchases[purchases['date'] < '2016-12-31T23:59:59'] # consider only dates before january
print(purchases.shape)
test_df = pd.read_csv("data/labels_predict.txt")
print(test_df.shape)

# remove customer-product pairs in test dataframe
purchases['customer_product'] = purchases['customerId'].astype(str) + '_' + purchases['productId'].astype(str)
test_df['customer_product'] = test_df['customerId'].astype(str) + '_' + test_df['productId'].astype(str)

filtered_purchases = purchases[~purchases.customer_product.isin(test_df.customer_product)].drop(columns=['customer_product'])
filtered_purchases.shape

(1543041, 5)
(3345261, 3)

(1526062, 5)

In [3]:
# count number of purchases per product
filtered_purchases['purchaseCount'] = 1
product_purchase_count = filtered_purchases.groupby('productId').agg({'purchaseCount':'sum'})
print(product_purchase_count)
customer_purchase_count = filtered_purchases.groupby('customerId').agg({'purchaseCount':'sum'})
print(customer_purchase_count)
# filtered_purchases.groupby('productId').agg({'purchasePrice': ['min', 'max', 'mean', 'median']})

           purchaseCount
productId
97242                  1
152384                86
219628                14
247775                12
247790                 4
...                  ...
7706103                2
7710905                9
7728621               18
7739265                1
7749551                4

[130445 rows x 1 columns]
            purchaseCount
customerId
1                      16
5                       6
9                      18
11                     12
20                      2
...                   ...
399460                 12
399469                  3
399472                 26
399473                 16
399474                  4

[191731 rows x 1 columns]

In [4]:
products = pd.read_csv("data/products.txt")
products

        productId  brand  price  productType  onSale           dateOnSite
0         5686531     53   22.5         1562    True  2015-12-21T12:38:21
1         7646044  14095    8.0         1479   False  2016-12-28T11:28:11
2         6411771    298  291.5         1624    True  2016-12-12T12:01:40
3         6248061  12335   36.0         1465    True  2016-07-07T11:44:09
4         6789251  12840   22.0         4033    True  2016-08-01T12:04:26
...           ...    ...    ...          ...     ...                  ...
192491    7099978   3594   42.5          727    True  2016-09-12T11:47:53
192492    7370190    608   33.0         1600   False  2016-12-21T13:26:23
192493    6659483  14967    7.5         4238    True  2016-07-25T12:13:02
192494    7013185     53   32.5         1465    True  2016-12-19T22:59:48
192495    6021411     53   18.0         1562    True  2016-05-19T08:14:18

[192496 rows x 6 columns]

In [6]:
products_with_count = pd.merge(products, product_purchase_count, left_on=['productId'], right_on=['productId'], how='left')
products_with_count.purchaseCount.fillna(0, inplace=True)
products_with_count

,productId,brand,price,productType,onSale,dateOnSite,purchaseCount
0,5686531,53,22.5,1562,True,2015-12-21T12:38:21,6.0
1,7646044,14095,8.0,1479,False,2016-12-28T11:28:11,0.0
2,6411771,298,291.5,1624,True,2016-12-12T12:01:40,0.0
3,6248061,12335,36.0,1465,True,2016-07-07T11:44:09,0.0
4,6789251,12840,22.0,4033,True,2016-08-01T12:04:26,3.0
...,...,...,...,...,...,...,...
192491,7099978,3594,42.5,727,True,2016-09-12T11:47:53,11.0
192492,7370190,608,33.0,1600,False,2016-12-21T13:26:23,0.0
192493,6659483,14967,7.5,4238,True,2016-07-25T12:13:02,4.0
192494,7013185,53,32.5,1465,True,2016-12-19T22:59:48,9.0
192495,6021411,53,18.0,1562,True,2016-05-19T08:14:18,13.0

In [52]:
products_with_count

,productId,brand,price,productType,onSale,dateOnSite,purchaseCount
0,5686531,53,22.5,1562,True,2015-12-21T12:38:21,6.0
1,7646044,14095,8.0,1479,False,2016-12-28T11:28:11,0.0
2,6411771,298,291.5,1624,True,2016-12-12T12:01:40,0.0
3,6248061,12335,36.0,1465,True,2016-07-07T11:44:09,0.0
4,6789251,12840,22.0,4033,True,2016-08-01T12:04:26,3.0
...,...,...,...,...,...,...,...
192491,7099978,3594,42.5,727,True,2016-09-12T11:47:53,11.0
192492,7370190,608,33.0,1600,False,2016-12-21T13:26:23,0.0
192493,6659483,14967,7.5,4238,True,2016-07-25T12:13:02,4.0
192494,7013185,53,32.5,1465,True,2016-12-19T22:59:48,9.0
192495,6021411,53,18.0,1562,True,2016-05-19T08:14:18,13.0

In [46]:
# # load data
# df = pd.read_csv("data/labels_training.txt")
products

        productId  brand  price  productType  onSale           dateOnSite
0         5686531     53   22.5         1562    True  2015-12-21T12:38:21
1         7646044  14095    8.0         1479   False  2016-12-28T11:28:11
2         6411771    298  291.5         1624    True  2016-12-12T12:01:40
3         6248061  12335   36.0         1465    True  2016-07-07T11:44:09
4         6789251  12840   22.0         4033    True  2016-08-01T12:04:26
...           ...    ...    ...          ...     ...                  ...
192491    7099978   3594   42.5          727    True  2016-09-12T11:47:53
192492    7370190    608   33.0         1600   False  2016-12-21T13:26:23
192493    6659483  14967    7.5         4238    True  2016-07-25T12:13:02
192494    7013185     53   32.5         1465    True  2016-12-19T22:59:48
192495    6021411     53   18.0         1562    True  2016-05-19T08:14:18

[192496 rows x 6 columns]

In [1]:
customers_count = filtered_purchases.groupby('customerId').agg({'purchaseCount':'sum'})
customers_count

NameError: name 'filtered_purchases' is not defined

In [30]:
import pandas as pd
from main import process_date_col
products = pd.read_csv("data/products.txt")

# date = pd.to_datetime(products['dateOnSite'], errors='coerce')
# print(f'Nb nan : {date.dt.month.isna().sum()}')
# date = date.fillna(date.median())

# pd.DataFrame({
#     # 'year':date.dt.year,
#     'month':date.dt.month, # categorical 12
#     'week':date.dt.isocalendar().week,# categorical 53
#     'day':date.dt.day, # categorical 31
#     'dayname':date.dt.day_name(), # categorical 7
# })

Nb nan : 142

In [52]:
date.dt.year # not categorical
date.dt.month # categorical 12
date.dt.isocalendar().week # categorical 53
date.dt.day # categorical 31
date.dt.day_name().unique() # categorical 7

array(['Monday', 'Wednesday', 'Thursday', 'Friday', 'Tuesday', 'Saturday',
       'Sunday'], dtype=object)

        year  month  week  day    dayname
0       2015     12    52   21     Monday
1       2016     12    52   28  Wednesday
2       2016     12    50   12     Monday
3       2016      7    27    7   Thursday
4       2016      8    31    1     Monday
...      ...    ...   ...  ...        ...
192491  2016      9    37   12     Monday
192492  2016     12    51   21  Wednesday
192493  2016      7    30   25     Monday
192494  2016     12    51   19     Monday
192495  2016      5    20   19   Thursday

[192496 rows x 5 columns]

In [ ]:
1